{
    "B1": {
        "BP": {
            "0": {
                "0": "Regulation of GTPase activity, MAPK cascade, and Ras protein signal transduction.",
                "1": "Involvement in second-messenger-mediated and adenylate cyclase-modulating G protein-coupled receptor signaling pathways.",
                "2": "Homeostasis and transport of divalent inorganic cations.",
                "3": "Responses to external biotic stimuli, including defense responses to bacteria."
            },
            "4": {
                "0": "Biosynthetic processes of ribose phosphate, nucleotides, and purine compounds.",
                "1": "Metabolic processes related to ATP and purine nucleosides."
            },
            "8": {
                "0": "Biogenesis of cellular components, RNA processing, and ribosome biogenesis.",
                "1": "Regulation of GTPase activity and myosin filament organization in Ras protein signal transduction.",
                "2": "Organization of supramolecular fibers, cell projections, and chemotaxis to cAMP.",
                "3": "Processes in cell division and the mitotic cell cycle, including cytokinesis."
            },
            "12": {
                "0": "Cellular and protein catabolic processes, including ubiquitin-dependent pathways.",
                "1": "Metabolic processes of isoprenoids, sterols, and organic hydroxy compounds."
            },
            "16": {
                "0": "Regulation of actin cytoskeleton, cellular component size, and cytoskeleton organization.",
                "1": "Organization of actin cytoskeleton and filament-based processes.",
                "2": "Positive regulation of protein-containing complex assembly and actin filament polymerization."
            },
            "20": {
                "0": "Regulation of cellular macromolecule biosynthetic processes, translation, and peptide metabolism.",
                "1": "Cellular and chemical homeostasis, including maintenance of location in cell.",
                "2": "Developmental processes and morphogenesis, including sporulation and cell differentiation.",
                "3": "Negative regulation of protein polymerization and actin filament depolymerization."
            }
        },
        "DB": {
            "0": {
                "0": "Effects on cell adhesion, fruiting body size, polarity, chemotaxis, growth, and cytokinesis.",
                "1": "Aberrant growth, migration, and morphogenesis in various developmental stages."
            },
            "4": {
                "0": "Impacts on cell polarity, chemotaxis, growth, cytokinesis, and morphology."
            },
            "8": {
                "0": "Alterations in cell adhesion, fruiting body size, polarity, chemotaxis, and morphology."
            },
            "12": {
                "0": "Effects on pinocytosis, cell growth, cytokinesis, and morphology.",
                "1": "Abnormalities in stream development, vegetative growth, migration, and signaling."
            },
            "16": {
                "0": "Changes in actin filament polymerization, cell polarity, chemotaxis, and morphology."
            },
            "20": {
                "0": "Influences on cell adhesion, actin filament dynamics, polarity, chemotaxis, and morphology."
            }
        },
        "MF": {
            "0": {
                "0": "Transmembrane transport activities, focusing on ATP-dependent and ABC transporter functions.",
                "1": "Enzymatic activities related to lyases and vitamin B6.",
                "2": "Metal and ion transport across membranes, including channel functions.",
                "3": "G protein-coupled receptor functions, especially in cyclic nucleotide binding."
            },
            "4": {
                "0": "RNA-related activities, including aminoacyl-tRNA ligase and RNA helicase functions.",
                "1": "Diverse transmembrane transporter activities, especially for ions.",
                "2": "Guanyl nucleotide-related activities, notably GTPase functions.",
                "3": "Lyase activities with an emphasis on vitamin B6."
            },
            "8": {
                "0": "RNA processing activities, including ligase and nuclease functions.",
                "1": "Regulatory functions in enzyme and GTPase activities.",
                "2": "ATP hydrolysis and RNA helicase activities."
            },
            "12": {
                "0": "Heme and electron transfer related activities, including oxidoreductases.",
                "1": "RNA processing activities, focusing on ligase functions.",
                "2": "Binding activities for lipids and actin, such as phospholipid binding.",
                "3": "Protein and myosin phosphatase activities."
            },
            "16": {
                "0": "RNA processing activities, including ligases and helicases.",
                "1": "Binding activities with lipids and cytoskeletal proteins.",
                "2": "Transmembrane ion transport and ATP-dependent functions.",
                "3": "Regulatory activities in kinase and GTPase functions."
            },
            "20": {
                "0": "DNA and RNA processing activities, including ligases.",
                "1": "Lyase activities related to vitamin B6 and carboxy-lyases.",
                "2": "Enzyme binding and guanyl nucleotide activities.",
                "3": "Lipid and cytoskeletal protein binding activities."
            }
        }        
    },
    "C1": {
        "BP": {
            "0": {
                "0": "Processes in cellular development and differentiation, including sorocarp development and GPCR signaling.",
                "1": "Biosynthesis of aromatic and organic cyclic compounds and regulation of nitrogen compound metabolism.",
                "2": "Positive regulation of transcription initiation and biosynthetic processes at the RNA polymerase II promoter."
            },
            "4": {
                "0": "Biosynthesis of aromatic compounds and regulation of nucleobase-containing compound metabolism.",
                "1": "Processes in glycoprotein metabolism and glycosylation."
            },
            "8": {
                "0": "Regulation of various transport processes, including endocytosis and macropinocytosis.",
                "1": "Regulation of biosynthetic processes, translation, and cellular metabolic processes.",
                "2": "Regulation of phosphorylation and kinase activity.",
                "3": "Cell-cell signaling and regulation of protein binding."
            },
            "12": {
                "0": "Biosynthesis and regulation of nucleic acid-templated transcription.",
                "1": "Positive regulation of nucleobase-containing compound metabolic processes and transcription.",
                "2": "Regulation of metabolic processes and gene expression."
            },
            "16": {
                "0": "Regulation of actin cytoskeleton organization and protein polymerization.",
                "1": "Organization and polymerization processes of actin filaments.",
                "2": "Positive regulation of protein-containing complex assembly and cellular component organization.",
                "3": "Negative regulation of protein polymerization and cytoskeleton organization."
            },
            "20": {
                "0": "Biosynthesis of ribose phosphate and nucleoside monophosphates.",
                "1": "Processes in morphogenesis, cellular development, and stress response.",
                "2": "Metabolism of ncRNA and organonitrogen compounds.",
                "3": "Metabolic processes related to membrane lipids."
            }
        },
        "DB": {
            "0": {
                "0": "Various aberrations in slug migration, aggregation, and culmination processes."
            },
            "4": {
                "0": "Changes in cell adhesion, morphology, and actin filament dynamics.",
                "1": "Aberrations in vegetative growth, slug migration, and culmination."
            },
            "8": {
                "0": "Altered cell adhesion, motility, and cytokinesis."
            },
            "12": {
                "0": "Disruptions in vegetative growth and slug migration."
            },
            "16": {
                "0": "Altered cell adhesion, actin dynamics, and cytokinesis."
            },
            "20": {
                "0": "Changes in cell morphology, adhesion, and actin polymerization."
            }
        },
        "MF": {
            "0": {
                "0": "Binding and regulatory activities, including enzyme and GTPase interactions.",
                "1": "Nucleotide binding and GTPase activities.",
                "2": "Phosphatase activities and hydrolysis functions.",
                "3": "Kinase and phosphotransferase activities."
            },
            "4": {
                "0": "Binding activities with lipids and actin, and motor functions.",
                "1": "Nucleotide binding and GTPase activities.",
                "2": "Phosphatase activities and hydrolysis functions."
            },
            "8": {
                "0": "DNA-binding activities and transcription regulation.",
                "1": "Binding activities with lipids, actin, and proteins.",
                "2": "Nucleotide binding and GTPase activities.",
                "3": "Lyase activities and vitamin binding."
            },
            "12": {
                "0": "Enzyme binding and regulatory activities, including kinase functions.",
                "1": "Regulatory activities in GTPase and kinase functions.",
                "2": "Phosphatase and hydrolysis activities.",
                "3": "Kinase activities and phosphotransferase functions."
            },
            "16": {
                "0": "Binding and motor activities, focusing on cytoskeletal elements.",
                "1": "Transporter and ATP-dependent activities.",
                "2": "RNA processing activities, including ligase and helicase functions.",
                "3": "Nucleotide binding and GTPase activities."
            },
            "20": {
                "0": "Nucleic acid processing activities, including ligase and nuclease functions.",
                "1": "Binding activities with lipids and cytoskeletal elements.",
                "2": "Lyase activities and vitamin binding.",
                "3": "Transporter and ATP-dependent activities."
            }
        }
    },    
    "rgB": {
        "BP": {
            "0": {
                "0": "Regulation of transcription and biosynthetic processes at DNA and RNA levels.",
                "1": "Positive regulation of transcription and various biosynthetic processes."
            },
            "4": {
                "0": "Homeostasis and transport of divalent inorganic cations and ions.",
                "1": "Processes involved in cell division and the mitotic cell cycle."
            },
            "8": {
                "0": "Biosynthesis and metabolism of carboxylic acids, lipids, and organic acids.",
                "1": "Metabolic processes of nucleosides and carbohydrates.",
                "2": "Biosynthetic processes for phospholipids and inositol signaling."
            },
            "12": {
                "0": "Metabolic processes of purine nucleosides, ATP generation, and carbohydrate catabolism.",
                "1": "Catabolic processes of amino acids and organic acids.",
                "2": "Biosynthesis and metabolism of carboxylic and organic acids.",
                "3": "Metabolism of nucleotides, carbohydrates, and ribose phosphate."
            },
            "16": {
                "0": "Regulation of actin cytoskeleton, protein polymerization, and cytokinesis.",
                "1": "Positive regulation of receptor binding and signaling activities.",
                "2": "Regulation of cell projection assembly and organization."
            },
            "20": {
                "0": "Regulation of cellular component size and protein polymerization.",
                "1": "Response to nutrient levels and external stimuli.",
                "2": "Regulation of cell communication and signaling.",
                "3": "Processes in pinocytosis, phagocytosis, and transport regulation."
            }
        },
        "DB": {
            "0": {
                "0": "Changes in cell adhesion, motility, and actin filament dynamics."
            },
            "4": {
                "0": "Variations in pinocytosis, cell motility, and cytokinesis."
            },
            "8": {
                "0": "Alterations in cell adhesion, phagocytosis, and actin organization."
            },
            "12": {
                "0": "Changes in cell adhesion, polarity, and actin filament dynamics.",
                "1": "Aberrations in vegetative growth and slug migration."
            },
            "16": {
                "0": "Altered cell adhesion, actin polymerization, and cytokinesis."
            },
            "20": {
                "0": "Changes in cell morphology, actin dynamics, and chemotaxis."
            }
        },
        "MF": {
            "0": {
                "0": "DNA-binding activities and transcription regulation.",
                "1": "Phosphatase activities and hydrolysis functions.",
                "2": "Lyase activities and metal cluster binding.",
                "3": "Transporter activities for ions and metals."
            },
            "4": {
                "0": "Various transmembrane transporter activities.",
                "1": "Lyase activities and vitamin B6 binding.",
                "2": "DNA-binding transcription factor activities.",
                "3": "Nucleotide binding and GTPase activities."
            },
            "8": {
                "0": "Transporter activities for ions and metals.",
                "1": "Aminoacyl-tRNA ligase and catalytic activities on RNA.",
                "2": "Binding activities including enzyme and lipid interactions.",
                "3": "Nucleotide processing and RNA helicase activities."
            },
            "12": {
                "0": "Transporter activities for ions and metals.",
                "1": "Aminoacyl-tRNA ligase and catalytic activities on RNA.",
                "2": "Regulatory activities in GTPase and kinase functions.",
                "3": "GPCR activities and cyclic nucleotide binding."
            },
            "16": {
                "0": "Binding activities with lipids and actin, and motor functions.",
                "1": "Nucleotide binding and GTPase activities.",
                "2": "Regulatory activities in GTPase and kinase functions.",
                "3": "GPCR activities and cyclic nucleotide binding."
            },
            "20": {
                "0": "Binding activities with tubulin, lipids, and actin.",
                "1": "Regulatory activities in GTPase and kinase functions.",
                "2": "Nucleotide binding and GTPase activities."
            }
        }
    },    
    "B1_rgB": {
        "BP": {
            "0": {
                "0": "Processes related to cellular and protein catabolism, including ubiquitin-dependent pathways.",
                "1": "Positive regulation of nucleic acid-templated transcription and various metabolic processes.",
                "2": "Negative regulation of biosynthetic processes, mRNA catabolism, and organic cyclic compound degradation."
            },
            "4": {
                "0": "Processes involved in cell division, mitotic cell cycle, and cytoskeleton organization.",
                "1": "Mitotic nuclear division and regulation of cell cycle transitions.",
                "2": "Negative regulation of protein and supramolecular fiber organization."
            },
            "8": {
                "0": "Regulation of myosin II filament organization and various cellular organizational processes.",
                "1": "Response to starvation, stress, and external stimuli, including G protein-coupled receptor signaling.",
                "2": "Vesicle-mediated transport processes including endocytosis and phagocytosis."
            },
            "12": {
                "0": "Biosynthetic and metabolic processes of carboxylic acids, amino acids, and lipids.",
                "1": "ATP metabolism, carbohydrate derivative processing, and nucleotide biosynthesis.",
                "2": "Glycerophospholipid metabolism and phospholipid biosynthetic processes."
            },
            "16": {
                "0": "Ribose phosphate biosynthesis, purine metabolism, and carbohydrate derivative processing.",
                "1": "Purine nucleoside diphosphate and triphosphate metabolic processes and ATP generation.",
                "2": "Carboxylic acid biosynthesis and metabolism."
            },
            "20": {
                "0": "Anatomical structure development, response to chemicals, and organelle organization.",
                "1": "Cell division processes including mitotic cell cycle and cytokinesis."
            }
        },
        "DB": {
            "0": {
                "0": "Variations in cell motility, adhesion, actin filament dynamics, and cytokinesis."
            },
            "4": {},
            "8": {
                "0": "Changes in cell polarity, motility, and actin filament organization."
            },
            "12": {
                "0": "Alterations in growth rate, cytokinesis, actin polymerization, and cell morphology."
            },
            "16": {
                "0": "Disruption in cell adhesion, actin dynamics, cytokinesis, and cell morphology.",
                "1": "Abnormalities in vegetative growth, slug migration, and culmination."
            },
            "20": {
                "0": "Changes in phagocytosis, actin filament dynamics, pinocytosis, and cell motility."
            }
        },
        "MF": {
            "0": {
                "0": "Oxidoreductase activities and binding to iron-sulfur clusters.",
                "1": "Transmembrane transporter activities for ions and metals.",
                "2": "GTPase regulatory activities and actin binding functions.",
                "3": "Lyase activities and vitamin B6 binding."
            },
            "4": {
                "0": "DNA-binding transcription factor activities and nucleic acid interactions.",
                "1": "Aminoacyl-tRNA ligase and RNA catalytic activities.",
                "2": "Ion transporter and channel activities.",
                "3": "Guanine nucleotide binding and GTPase activities."
            },
            "8": {
                "0": "DNA-binding transcription factor activities and RNA catalytic functions.",
                "1": "Transmembrane transporter activities for ions and metals.",
                "2": "Binding activities with enzymes, lipids, and GTPases.",
                "3": "Nucleotide processing and RNA helicase activities."
            },
            "12": {
                "0": "Transmembrane transporter activities for ions and metals.",
                "1": "Aminoacyl-tRNA ligase and nucleic acid catalytic activities.",
                "2": "Guanine nucleotide binding and GTPase activities."
            },
            "16": {
                "0": "Aminoacyl-tRNA ligase and endonuclease activities.",
                "1": "Ion transporter and channel activities.",
                "2": "Guanine nucleotide binding and GTPase activities.",
                "3": "Transmembrane transporter activities."
            },
            "20": {
                "0": "Binding activities with enzymes, tubulin, lipids, and actin.",
                "1": "Aminoacyl-tRNA ligase and endonuclease activities.",
                "2": "Guanine nucleotide binding and GTPase activities.",
                "3": "Transmembrane transporter activities."
            }
        }
    },    
    "C1_rgB": {
        "BP": {
            "0": {
                "0": "Biosynthesis and metabolism of carboxylic acids, fatty acids, and lipids.",
                "1": "Processes related to cellular catabolism, protein degradation, and ubiquitin-dependent pathways.",
                "2": "Regulation of macromolecule biosynthesis, RNA metabolism, and transcription.",
                "3": "Metabolic processes involving isoprenoids, sterols, and organic hydroxy compounds."
            },
            "4": {
                "0": "Phospholipid biosynthesis and metabolism, including organophosphate processes.",
                "1": "Purine nucleoside diphosphate and triphosphate metabolism, ATP generation, and glycolysis.",
                "2": "Glycoprotein metabolism and various glycosylation processes."
            },
            "8": {
                "0": "Organization and regulation of the actin cytoskeleton, cytokinesis, and cellular component assembly.",
                "1": "Locomotion, chemotaxis, and responses to various stimuli in sorocarp development.",
                "2": "Responses to cAMP and various nitrogen, oxygen, and organic compounds."
            },
            "12": {
                "0": "Biosynthesis and metabolism of carboxylic acids, lipids, and small molecules.",
                "1": "Purine ribonucleoside metabolism, ATP processes, and carbohydrate metabolism.",
                "2": "Biosynthesis and regulation of aromatic compounds and transcription processes.",
                "3": "Catabolic processes involving organic substances, aromatic compounds, and heterocycles."
            },
            "16": {
                "0": "Regulation of DNA-templated transcription and various metabolic processes.",
                "1": "Biosynthetic processes involving aromatic compounds, DNA transcription, and RNA metabolism."
            },
            "20": {
                "0": "Regulation of nitrogen compound metabolism, gene expression, and various transcription processes.",
                "1": "Regulation of protein binding, signal transduction, and receptor activities."
            }
        },
        "DB": {
            "0": {
                "0": "Changes affecting fruiting body size, cell polarity, chemotaxis, and cytokinesis."
            },
            "4": {
                "0": "Alterations in actin filament dynamics, cell motility, cytokinesis, and cell morphology."
            },
            "8": {
                "0": "Variations in cell adhesion, actin filament organization, and chemotaxis."
            },
            "12": {
                "0": "Effects on cell adhesion, actin dynamics, cytokinesis, and cell morphology."
            },
            "16": {
                "0": "Disruptions in cell adhesion, fruiting body size, and various cellular processes."
            },
            "20": {
                "0": "Impacts on phagocytosis, actin dynamics, and cellular responses to cAMP.",
                "1": "Abnormalities in sorocarp development, cAMP signaling, and slug migration."
            }
        },
        "MF": {
            "0": {
                "0": "Protein dimerization and DNA-binding transcription factor activities.",
                "1": "Transmembrane transporter activities for ions and metals.",
                "2": "Carbon-carbon lyase and vitamin B6 binding activities.",
                "3": "Guanine nucleotide binding and hydrolase activities."
            },
            "4": {
                "0": "Heme and iron-sulfur cluster binding, oxidoreductase activities.",
                "1": "Transmembrane transporter activities for ions and metals.",
                "2": "Aminoacyl-tRNA ligase and methyltransferase activities.",
                "3": "Guanine nucleotide binding and GTPase activities."
            },
            "8": {
                "0": "Protein dimerization, DNA binding, and RNA helicase activities.",
                "1": "Binding activities related to actin and protein complexes.",
                "2": "Enzyme binding and molecular function regulator activities.",
                "3": "Phosphotransferase and kinase activities."
            },
            "12": {
                "0": "Protein dimerization and DNA-binding transcription factor activities.",
                "1": "Guanine nucleotide binding and hydrolase activities."
            },
            "16": {
                "0": "Protein dimerization and DNA-binding transcription factor activities.",
                "1": "Heme binding and oxidoreductase activities.",
                "2": "Transmembrane transporter activities.",
                "3": "Carbon-carbon lyase and vitamin B6 binding activities."
            },
            "20": {
                "0": "Transmembrane transporter activities for ions and metals.",
                "1": "Enzyme binding and regulator activities for GTPases and kinases.",
                "2": "Heme binding and oxidoreductase activities.",
                "3": "Ribonucleoside triphosphate phosphatase and hydrolase activities."
            }
        }
    },
    "AX4L846F": {
        "BP": {
            "0": {
                "0": "Amino acid catabolism, organic compound degradation, and metabolic processes.",
                "1": "Regulation of RNA metabolism and biosynthesis, transcription processes.",
                "2": "Carboxylic acid metabolism, lipid biosynthesis, and tRNA aminoacylation.",
                "3": "Glycoprotein biosynthesis and glycosylation processes."
            },
            "4": {
                "0": "Signal transduction, cell differentiation, and developmental processes.",
                "1": "Regulation of gene expression and macromolecule biosynthetic processes.",
                "2": "Negative regulation of metabolic and biosynthetic processes."
            },
            "8": {
                "0": "Regulation of signaling, chemotaxis, and cellular processes.",
                "1": "Cytoskeleton organization, chemotaxis to cAMP, and locomotion.",
                "2": "Developmental processes and interaction between organisms."
            },
            "12": {
                "0": "Small molecule and lipid metabolic processes, acid biosynthesis.",
                "1": "Purine nucleotide metabolism and biosynthesis, carbohydrate derivative processes."
            },
            "16": {
                "0": "Actin filament organization, protein polymerization, and cytoskeleton organization.",
                "1": "Ion homeostasis, chemical homeostasis, and cellular response to stress."
            },
            "20": {
                "0": "G protein-coupled receptor signaling and regulation.",
                "1": "Amino acid catabolism, organic acid metabolism, and biosynthesis.",
                "2": "Negative chemotaxis, regulation of protein binding, and signaling receptor activity.",
                "3": "Developmental processes, taxis, and cooperative development."
            }
        },
        "MF": {
            "0": {
                "0": "Oxidoreductase and electron transfer activities, heme binding.",
                "1": "Catalytic activity on nucleic acids, ligase activity, RNA binding.",
                "2": "Transmembrane transporter and channel activities.",
                "3": "Transcription regulation and DNA binding activities."
            },
            "4": {
                "0": "Actin and phospholipid binding, cytoskeletal activities.",
                "1": "GTPase activator and regulator activities, enzyme regulation.",
                "2": "Protein kinase activities and catalytic functions."
            },
            "8": {
                "0": "Transcription regulation, nucleic acid and DNA binding activities.",
                "1": "Enzyme and small GTPase binding, regulatory activities.",
                "2": "Actin binding, cytoskeletal activities.",
                "3": "ATP-dependent transmembrane transporter activities."
            },
            "12": {
                "0": "Catalytic activity on nucleic acids, ligase activity, RNA binding.",
                "1": "Enzyme and actin binding, cytoskeletal activities.",
                "2": "Transmembrane transporter and channel activities.",
                "3": "ATP-dependent transmembrane transporter activities."
            },
            "16": {
                "0": "Transmembrane transporter and electron transfer activities.",
                "1": "Actin and phospholipid binding, cytoskeletal activities.",
                "2": "Ligase activity, RNA binding.",
                "3": "GTPase and pyrophosphatase activities, nucleotide binding."
            },
            "20": {
                "0": "Transcription regulation, nucleic acid binding.",
                "1": "Transmembrane transporter activities, ion translocation.",
                "2": "GTPase activator and regulator activities, enzyme regulation.",
                "3": "Protein kinase activities, phosphotransferase functions."
            }
        },
        "DB": {
            "0": {
                "0": "Altered cell morphology, motility, and cytokinesis.",
                "1": "Disrupted aggregation, signaling, and culmination processes."
            },
            "4": {
                "0": "Changes in cell morphology, motility, and cytokinesis."
            },
            "8": {
                "0": "Altered cell motility, growth, and cytoskeleton organization.",
                "1": "Disrupted aggregation, culmination, and morphogenesis."
            },
            "12": {
                "0": "Abnormal cell morphology, motility, and protein kinase activity."
            },
            "16": {
                "0": "Altered cell morphology, motility, and cytoskeleton organization."
            },
            "20": {
                "0": "Changes in cell morphology, motility, and cytoskeleton organization.",
                "1": "Disrupted aggregation, culmination, and signaling processes."
            }
        }
    },    
    "B1_L846F": {
        "BP": {
            "0": {
                "0": "Regulation of biosynthetic processes, RNA biosynthesis, and DNA-templated transcription."
            },
            "4": {
                "0": "Chromosome segregation, microtubule organization, and mitotic processes.",
                "1": "Regulation of gene expression, translation, and amide metabolism.",
                "2": "Amino acid catabolism and organic compound catabolic processes.",
                "3": "Ribosome biogenesis, RNA processing, and ncRNA metabolism."
            },
            "8": {
                "0": "Cellular secretion, vesicle transport, and regulation of endocytosis.",
                "1": "Negative regulation of cellular and protein metabolism.",
                "2": "Cellular component organization and regulation of protein polymerization.",
                "3": "Intracellular protein localization and transport."
            },
            "12": {
                "0": "Amino acid and lipid metabolism, small molecule catabolic processes.",
                "1": "Purine nucleoside diphosphate and ATP metabolic processes."
            },
            "16": {
                "0": "Regulation of actin filament polymerization and cellular component size.",
                "1": "Positive regulation of cellular component biogenesis and cytoskeleton organization.",
                "2": "Negative regulation of protein and fiber organization."
            },
            "20": {
                "0": "Regulation of actin polymerization, cellular component size, and organization.",
                "1": "Cellular component disassembly and negative regulation of protein polymerization.",
                "2": "Regulation of transport and vesicle-mediated transport.",
                "3": "Regulation of cell projection organization and assembly."
            }
        },
        "MF": {
            "0": {
                "0": "Transcription regulator activity and DNA binding.",
                "1": "Transmembrane transporter and channel activities.",
                "2": "Catalytic activity on nucleic acids and RNA binding.",
                "3": "ATP hydrolysis and pyrophosphatase activities."
            },
            "4": {
                "0": "Catalytic activity on nucleic acids, ligase activity, and RNA binding.",
                "1": "Transmembrane transporter and channel activities.",
                "2": "Vitamin binding and lyase activities.",
                "3": "Transmembrane transporter and ATP-dependent activities."
            },
            "8": {
                "0": "Catalytic activity on nucleic acids, nuclease activity, and RNA binding.",
                "1": "Enzyme and small GTPase binding, regulatory activities.",
                "2": "Transmembrane transporter and channel activities.",
                "3": "ATP-dependent transmembrane transporter activities."
            },
            "12": {
                "0": "Enzyme and kinase binding, small GTPase interactions.",
                "1": "GTPase activator and regulator activities, enzyme regulation.",
                "2": "Vitamin binding and lyase activities.",
                "3": "Protein kinase and phosphotransferase activities."
            },
            "16": {
                "0": "Transmembrane transporter and electron transfer activities.",
                "1": "GTPase and ATP hydrolysis activities, protein folding functions.",
                "2": "Enzyme and kinase regulator activities, small GTPase interactions.",
                "3": "Phosphatase activities and protein dephosphorylation."
            },
            "20": {
                "0": "Enzyme and small GTPase binding, kinase regulation.",
                "1": "Actin and microtubule binding, cytoskeletal activities.",
                "2": "GTPase and nucleotide binding, pyrophosphatase activities.",
                "3": "Protein kinase activities and phosphotransferase functions."
            }
        },
        "DB": {
            "0": {
                "0": "Abnormal aggregation, signaling, and developmental arrest.",
                "1": "Altered cytoskeleton organization, motility, and cytokinesis."
            },
            "4": {
                "0": "Changes in cell morphology, motility, and cytokinesis."
            },
            "8": {
                "0": "Abnormal cell morphology, growth, and cytoskeleton organization."
            },
            "12": {
                "0": "Abnormal cell morphology, growth, and protein kinase activity.",
                "1": "Disrupted stream morphology and aggregation processes."
            },
            "16": {
                "0": "Altered cell morphology, motility, and actin filament organization."
            },
            "20": {
                "0": "Abnormal cell morphology, motility, and cytoskeleton organization.",
                "1": "Disrupted stream morphology and aggregation processes."
            }
        }
    }    
}